[
  {
    "image": "https://i.ibb.co.com/FqfDkmfx/note.webp",
    "title": "SkyNote",
    "companyName": "CloudApps Inc.",
    "id": 1,
    "descriptions": [
      "SkyNote revolutionizes digital note-taking with its seamless multi-device synchronization that ensures your thoughts are always accessible. Whether you're switching between your smartphone, tablet, or laptop, your notes update in real-time without any manual effort. The intuitive interface makes capturing ideas effortless with support for text, images, checklists, and voice recordings.",
      "Organize your digital life with SkyNote's powerful categorization system using customizable notebooks and smart tags. The advanced search functionality can locate specific information across all your notes instantly. With end-to-end encryption, your personal and professional notes remain completely secure from unauthorized access.",
      "Experience distraction-free note creation with SkyNote's clean design and focus mode. The app offers customizable templates for different use cases like meeting notes, project planning, and journaling. Collaborative features allow you to share selected notes with colleagues or friends while maintaining full control over editing permissions."
    ],
    "size": 32.5,
    "reviews": 1420,
    "ratingAvg": 4.5,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 480 },
      { "name": "5 star", "count": 700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/SD0wzCYR/fitness.jpg",
    "title": "FitTrack Pro",
    "companyName": "Wellness Works",
    "id": 2,
    "descriptions": [
      "FitTrack Pro serves as your comprehensive fitness coach with advanced activity tracking that goes beyond basic step counting. Monitor your heart rate variability, sleep quality, and recovery metrics to optimize your training schedule. The app provides personalized workout recommendations based on your fitness level and goals.",
      "Transform your nutrition with detailed calorie tracking and macro monitoring features. Scan barcodes to instantly log food items or use the voice input for quick entries. Get insights into your eating patterns with weekly nutrition reports and receive suggestions for balanced meal planning.",
      "Stay motivated with social features that let you join fitness challenges and share achievements with friends. The app integrates with popular wearables and offers offline mode for workouts without internet connection. Detailed analytics help you understand progress trends and adjust your fitness strategy accordingly."
    ],
    "size": 58.2,
    "reviews": 870,
    "ratingAvg": 4.3,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 140 },
      { "name": "4 star", "count": 310 },
      { "name": "5 star", "count": 280 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/203rWSf0/taskmamnage.jpg",
    "title": "TaskFlow",
    "companyName": "NextGen Labs",
    "id": 3,
    "descriptions": [
      "TaskFlow redefines productivity with its intelligent task prioritization system that automatically organizes your to-do list based on deadlines and importance. The smart scheduling feature suggests optimal times for task completion considering your work patterns and existing commitments.",
      "Collaborate effortlessly with team members through shared project boards and real-time updates. Assign tasks with clear deadlines and dependencies, while the progress tracking system keeps everyone accountable. Integrated communication tools reduce the need for switching between multiple apps.",
      "Visualize your workflow with multiple view options including Kanban boards, calendar layouts, and timeline perspectives. Set recurring tasks for routine activities and receive smart reminders that account for travel time and preparation needs. The time tracking feature helps identify productivity patterns and areas for improvement."
    ],
    "size": 45.8,
    "reviews": 2300,
    "ratingAvg": 4.7,
    "downloads": "7M",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 1170 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Cphb0BTv/finance.jpg",
    "title": "BudgetMate",
    "companyName": "FinTrack Co.",
    "id": 4,
    "descriptions": [
      "BudgetMate simplifies financial management with automatic bank connectivity that securely imports and categorizes your transactions. Set up custom spending categories and monthly budgets that align with your financial goals. Receive instant notifications for unusual spending patterns or budget exceedances.",
      "Plan for the future with sophisticated goal-setting features for vacations, emergency funds, or major purchases. The app projects your savings timeline and suggests achievable monthly contribution amounts. Visual progress trackers keep you motivated as you work toward your financial targets.",
      "Protect your financial health with credit score monitoring and bill payment reminders. The net worth calculator aggregates all your accounts and assets to provide a comprehensive financial picture. Export detailed reports for tax preparation or financial advisor meetings with just a few taps."
    ],
    "size": 38.4,
    "reviews": 1340,
    "ratingAvg": 4.1,
    "downloads": "4M",
    "ratings": [
      { "name": "1 star", "count": 130 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 390 },
      { "name": "5 star", "count": 450 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vxk4gVdY/editing.webp",
    "title": "PhotoEase",
    "companyName": "PixelCraft Studio",
    "id": 5,
    "descriptions": [
      "PhotoEase delivers professional editing capabilities with its advanced color grading tools and precision adjustment sliders. Work with curves, levels, and selective color editing to achieve the exact look you envision. The non-destructive editing process preserves your original images throughout the creative workflow.",
      "Enhance portraits effortlessly with AI-powered beauty tools that smooth skin, whiten teeth, and remove blemishes naturally. The body shaping features allow subtle adjustments while maintaining realistic proportions. Advanced eye enhancement and hair editing tools help create stunning portrait photography.",
      "Unleash your creativity with hundreds of customizable filters and special effects. Create double exposures, add light leaks, or apply artistic textures to transform your photos. The layer support enables complex compositions, while text tools with extensive font libraries help design social media graphics quickly."
    ],
    "size": 76.9,
    "reviews": 2980,
    "ratingAvg": 4.6,
    "downloads": "9M",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 1760 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zV8Kjkzk/langagee.png",
    "title": "LinguaGo",
    "companyName": "EduSoft",
    "id": 6,
    "descriptions": [
      "LinguaGo employs scientifically-proven spaced repetition algorithms to optimize vocabulary retention and language acquisition. The adaptive learning system identifies your strengths and weaknesses, customizing lesson content to focus on areas needing improvement. Progress tracking shows your fluency development across reading, writing, listening, and speaking skills.",
      "Practice real-world conversations with AI-powered chat partners that simulate native speakers in various scenarios. From ordering food in a restaurant to business negotiations, you'll build confidence for actual conversations. The speech recognition technology provides instant feedback on pronunciation and fluency.",
      "Immerse yourself in the target language with curated content from native sources including news articles, videos, and podcasts. Cultural notes provide context about customs and traditions, enhancing your understanding beyond just vocabulary. The community features connect you with other learners for practice and cultural exchange."
    ],
    "size": 64.3,
    "reviews": 1790,
    "ratingAvg": 4.4,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 110 },
      { "name": "2 star", "count": 130 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 560 },
      { "name": "5 star", "count": 800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/byF6vm7/cloudestorage.jpg",
    "title": "DriveSync",
    "companyName": "SecureCloud Ltd.",
    "id": 7,
    "descriptions": [
      "DriveSync ensures business-grade security with zero-knowledge encryption where only you hold the decryption keys. Two-factor authentication adds an extra layer of protection against unauthorized access. The remote wipe capability allows you to securely erase files from lost or stolen devices while preserving cloud copies.",
      "Streamline team collaboration with shared folders that maintain version history and track changes. Set granular permissions for viewing, editing, or commenting on files. The activity feed shows recent modifications and team interactions, keeping everyone informed about project developments.",
      "Automate your backup routines with scheduled sync operations that capture important files from designated folders. The smart sync feature conserves device storage by keeping only frequently accessed files locally while maintaining cloud access to everything. File recovery options restore previous versions or retrieve accidentally deleted items."
    ],
    "size": 89.6,
    "reviews": 2450,
    "ratingAvg": 4.2,
    "downloads": "8M",
    "ratings": [
      { "name": "1 star", "count": 160 },
      { "name": "2 star", "count": 190 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 1080 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Tx896HjM/meditation.jpg",
    "title": "MindCalm",
    "companyName": "Zenify Apps",
    "id": 8,
    "descriptions": [
      "MindCalm offers guided meditation sessions led by world-renowned mindfulness experts across various disciplines. Choose from different session lengths ranging from quick 5-minute stress relievers to extended 60-minute deep meditation practices. The progressive programs systematically build your meditation skills over weeks.",
      "Create personalized soundscapes by mixing natural elements like rain, ocean waves, and forest sounds with ambient tones. The binaural beats feature supports different brainwave states for relaxation, focus, or sleep. Customize background volume and guidance intensity to match your preference.",
      "Track your mindfulness journey with detailed statistics about your practice consistency and duration. The mood logging feature helps identify patterns between meditation and emotional states. Personalized recommendations suggest specific sessions based on your current stress levels and time availability."
    ],
    "size": 52.1,
    "reviews": 1980,
    "ratingAvg": 4.8,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 480 },
      { "name": "5 star", "count": 1300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/rKrgNkGC/notemaster.png",
    "title": "NoteMaster",
    "companyName": "AlphaApps",
    "id": 9,
    "descriptions": [
      "NoteMaster excels in multimedia note capture with seamless integration of handwritten input, typed text, and audio recordings in a single note. The smart handwriting recognition converts your handwritten notes to searchable digital text. Drawing tools with pressure sensitivity make sketching ideas natural and precise.",
      "Organize complex information with nested notebooks and cross-note linking capabilities. The table of contents feature automatically generates navigation for lengthy notes. Template gallery offers pre-designed layouts for common use cases like meeting minutes, research notes, and project outlines.",
      "Enhance productivity with quick capture widgets that let you create notes from the home screen or notification panel. The optical character recognition can extract text from images and documents. Export options include PDF, Word, and HTML formats with customizable styling for sharing or printing."
    ],
    "size": 28.3,
    "reviews": 980,
    "ratingAvg": 4.2,
    "downloads": "2M",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/217DVD91/healthbuddy.jpg",
    "title": "HealthBuddy",
    "companyName": "FitLife",
    "id": 10,
    "descriptions": [
      "HealthBuddy provides comprehensive health monitoring with integration for over 100 popular fitness devices and health apps. Track metrics like blood pressure, blood glucose, and body composition alongside activity data. The health dashboard presents a unified view of all your wellness indicators.",
      "Personalize your nutrition tracking with custom food items and recipes. The barcode scanner database contains millions of products with detailed nutritional information. Set macro targets for carbohydrates, proteins, and fats based on your dietary preferences and fitness objectives.",
      "Join community challenges and compete with friends on step counts, workout consistency, or nutrition goals. The achievement system rewards milestones with badges and shareable certificates. Wellness insights generated from your data help identify trends and suggest actionable improvements."
    ],
    "size": 60.1,
    "reviews": 1120,
    "ratingAvg": 4.3,
    "downloads": "3.5M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 550 },
      { "name": "5 star", "count": 260 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DD9ymxCV/taskhero.jpg",
    "title": "TaskHero",
    "companyName": "Prodigy Apps",
    "id": 11,
    "descriptions": [
      "TaskHero streamlines project visualization with customizable Kanban boards that can be tailored to any workflow. Create unlimited columns with specific rules for task progression. The card system holds detailed information including checklists, attachments, and comments in an organized layout.",
      "Facilitate team coordination with @mentions, task assignments, and deadline notifications. The activity log tracks all changes and communications for complete project transparency. File attachments with version control ensure everyone accesses the latest documents.",
      "Optimize resource allocation with workload views that show team capacity and task distribution. The time estimation feature helps with project planning and deadline setting. Gantt chart visualization displays project timelines and dependencies for complex initiatives."
    ],
    "size": 42.5,
    "reviews": 900,
    "ratingAvg": 4.5,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 260 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/J9BbXpH/budjtwise.jpg",
    "title": "BudgetWise",
    "companyName": "MoneySmart",
    "id": 12,
    "descriptions": [
      "BudgetWise simplifies financial tracking with automatic transaction categorization that learns from your manual corrections. Set up bill reminders with due dates and payment amounts to avoid late fees. The cash flow forecast predicts your account balances based on scheduled transactions.",
      "Achieve savings goals with visual progress trackers and milestone celebrations. The round-up feature automatically saves spare change from transactions into your goal accounts. Create separate envelopes for different spending categories to maintain budget discipline.",
      "Generate comprehensive spending reports with interactive charts and export capabilities. Compare monthly spending patterns to identify areas for improvement. The financial health score provides an overall assessment of your money management habits with actionable improvement suggestions."
    ],
    "size": 35.7,
    "reviews": 760,
    "ratingAvg": 4.1,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 235 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wFJ6zmnd/photo.jpg",
    "title": "PhotoSpark",
    "companyName": "ImageMagic",
    "id": 13,
    "descriptions": [
      "PhotoSpark offers one-touch enhancement that intelligently analyzes and improves lighting, color balance, and composition. The AI-powered scene recognition automatically applies optimal settings for portraits, landscapes, food, or architecture. Before-and-after comparison makes it easy to see your edits.",
      "Create stunning collages with flexible grid layouts and customizable spacing. Add backgrounds, stickers, and text overlays to personalize your creations. The template library includes trendy designs optimized for different social media platforms.",
      "Apply artistic filters that mimic popular film stocks and vintage camera effects. Adjust filter intensity and selectively apply effects to specific areas of your photos. The healing tool removes unwanted objects while intelligently filling the background for natural-looking results."
    ],
    "size": 70.2,
    "reviews": 1340,
    "ratingAvg": 4.6,
    "downloads": "4.5M",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/XZHDbsW1/lanfguagelearn.png",
    "title": "LangLearn",
    "companyName": "Polyglot Co.",
    "id": 14,
    "descriptions": [
      "LangLearn makes vocabulary acquisition engaging through interactive games like word matching, spelling challenges, and pronunciation exercises. The spaced repetition system ensures you review words at optimal intervals for long-term retention. Earn points and unlock new levels as you progress.",
      "Practice listening comprehension with audio exercises featuring native speakers at different speeds. The dialogue simulations prepare you for real conversations in restaurants, hotels, and social situations. Interactive transcripts help you follow along and learn new vocabulary in context.",
      "Track your learning streak and compete with friends on leaderboards. The achievement system rewards consistent practice and milestone accomplishments. Cultural insights embedded in lessons provide context about customs, holidays, and social norms in different countries."
    ],
    "size": 58.9,
    "reviews": 1100,
    "ratingAvg": 4.4,
    "downloads": "2.8M",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 330 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/G48k3dBN/cloud.png",
    "title": "CloudBox",
    "companyName": "SkyNet Solutions",
    "id": 15,
    "descriptions": [
      "CloudBox ensures maximum uptime with redundant server infrastructure across multiple geographical locations. The file versioning system maintains up to 100 previous versions of each document for recovery needs. Advanced sharing options include password protection and expiration dates for links.",
      "Automatically backup photos from your camera roll with options for original quality or optimized storage. The document scanner feature captures physical papers and converts them to searchable PDF files. Selective sync conserves device storage by choosing which folders to keep locally.",
      "Access your files offline by marking them available for offline use. The recent files section provides quick access to recently opened documents. File preview capabilities allow viewing documents, images, and videos without downloading them first."
    ],
    "size": 92.3,
    "reviews": 1450,
    "ratingAvg": 4.2,
    "downloads": "5.5M",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 550 },
      { "name": "5 star", "count": 390 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/N0Qt8ZS/calmmind.jpg",
    "title": "CalmMind",
    "companyName": "Mindful Apps",
    "id": 16,
    "descriptions": [
      "CalmMind offers meditation programs specifically designed for common life challenges like anxiety management, sleep improvement, and focus enhancement. Each program consists of daily sessions that build skills progressively. The introductory courses help beginners establish consistent practice.",
      "Customize your meditation experience with adjustable background sounds, bell intervals, and voice guidance levels. The breathing exercise library includes techniques for energy, relaxation, and stress relief. Visual breathing guides help maintain proper rhythm during practice.",
      "Establish daily mindfulness habits with customizable reminders and meditation scheduling. The journal feature allows recording reflections and insights after each session. Progress statistics show your consistency and total meditation time for motivation."
    ],
    "size": 50.4,
    "reviews": 980,
    "ratingAvg": 4.7,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 400 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/hRgM8ZFf/tadkmanager.jpg",
    "title": "TaskManager X",
    "companyName": "EfficientSoft",
    "id": 17,
    "descriptions": [
      "TaskManager X intelligently prioritizes your tasks using the Eisenhower Matrix methodology, distinguishing between urgent and important activities. The smart scheduling feature considers your energy levels throughout the day when suggesting task timing. Time blocking functionality helps allocate specific periods for focused work.",
      "Break down complex projects into manageable sub-tasks with dependencies and individual deadlines. The progress tracking shows completion percentage for multi-step tasks. Template system allows saving frequently used task structures for recurring projects.",
      "Stay productive anywhere with location-based reminders that trigger when you arrive at specific places like office, home, or grocery store. The time tracking feature records how long you spend on each task for productivity analysis. Performance reports identify your most productive times and common distractions."
    ],
    "size": 40.5,
    "reviews": 870,
    "ratingAvg": 4.3,
    "downloads": "2.5M",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 215 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/SgW670H/moneymanagement.jpg",
    "title": "MoneyManager",
    "companyName": "FinancePro",
    "id": 18,
    "descriptions": [
      "MoneyManager provides complete financial overview by connecting to banking, investment, and loan accounts in one dashboard. The net worth tracker updates automatically as account balances change. Asset allocation charts show your investment distribution across different categories.",
      "Create detailed budgets with rollover capabilities for unused amounts. The bill management system tracks due dates, amounts, and payment status across all your accounts. Subscription monitoring identifies recurring charges and helps cancel unwanted services.",
      "Analyze spending patterns with customizable reports that can be filtered by time period, category, or payment method. The tax preparation feature categorizes deductible expenses throughout the year. Investment performance tracking shows returns across different assets and time frames."
    ],
    "size": 36.9,
    "reviews": 930,
    "ratingAvg": 4.1,
    "downloads": "2M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 230 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Q3Hy52zZ/phptpeditor.jpg",
    "title": "PhotoEditor Plus",
    "companyName": "CreativeSoft",
    "id": 19,
    "descriptions": [
      "PhotoEditor Plus offers professional-grade color correction with curves, levels, and selective color adjustment tools. The healing brush and clone stamp remove imperfections while preserving texture. Layer support with blending modes enables complex photo compositions and creative effects.",
      "Transform images with perspective correction and lens distortion fixes. The batch processing feature applies the same edits to multiple photos simultaneously. History panel allows stepping back through edits, with option to save specific steps as favorites for future use.",
      "Create stunning visuals with advanced text tools featuring hundreds of fonts and customizable styling options. The shape library includes vector elements that remain crisp at any size. Export presets optimize images for different platforms like Instagram, Facebook, or print publications."
    ],
    "size": 75.0,
    "reviews": 1400,
    "ratingAvg": 4.5,
    "downloads": "4M",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 510 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DffBBWYM/language.jpg",
    "title": "LinguaMaster",
    "companyName": "LearnX",
    "id": 20,
    "descriptions": [
      "LinguaMaster structures language learning through comprehensive courses that cover grammar, vocabulary, and cultural context. Each lesson builds upon previous knowledge with systematic progression. The placement test determines your starting level for personalized learning path.",
      "Practice speaking with voice recognition that provides detailed feedback on pronunciation accuracy. The conversation simulations use AI to create realistic dialogues for various scenarios. Recording feature allows comparing your pronunciation with native speakers.",
      "Reinforce learning with flashcards that use spaced repetition algorithm for optimal review schedule. The grammar exercises include detailed explanations of rules and exceptions. Cultural notes provide insights into idioms, customs, and social etiquette in different regions."
    ],
    "size": 60.7,
    "reviews": 1100,
    "ratingAvg": 4.4,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 320 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Q7WhcStR/cloud.jpg",
    "title": "CloudSync Pro",
    "companyName": "SecureTech",
    "id": 21,
    "descriptions": [
      "CloudSync Pro ensures business continuity with 99.9% uptime guarantee and redundant data centers. The file versioning maintains unlimited previous versions with option to permanently important revisions. Advanced sharing controls include watermarking for sensitive documents.",
      "Implement company-wide policies with administrative controls over sharing permissions and data retention. The audit log tracks all file activities for compliance requirements. Remote device management allows revoking access from lost or former employee devices.",
      "Optimize storage with duplicate file detection and smart compression for large files. The bandwidth controls manage upload/download speeds during business hours. Priority sync ensures critical files are available first when connecting from new devices."
    ],
    "size": 95.3,
    "reviews": 1200,
    "ratingAvg": 4.3,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 450 },
      { "name": "5 star", "count": 330 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/CpqLcLpn/medidate.jpg",
    "title": "MeditateNow",
    "companyName": "ZenLife",
    "id": 22,
    "descriptions": [
      "MeditateNow offers timed meditation sessions with interval bells and customizable background sounds. The session statistics track your daily streak and total meditation time. The favorite system allows quick access to frequently used meditation practices.",
      "Follow structured meditation courses designed for specific outcomes like stress reduction, better sleep, or improved focus. The beginner courses introduce fundamental techniques gradually. The expert sessions provide advanced practices for experienced meditators.",
      "Integrate mindfulness into daily life with quick meditation breaks suggested throughout the day. The breathing pacer helps maintain consistent rhythm during self-guided practice. The meditation journal allows recording insights and tracking emotional states over time."
    ],
    "size": 50.0,
    "reviews": 900,
    "ratingAvg": 4.6,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 140 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gb6ZYBT0/quicktasl.webp",
    "title": "QuickTasks",
    "companyName": "ProTasker",
    "id": 23,
    "descriptions": [
      "QuickTasks enables rapid task entry through voice commands, quick-type suggestions, and customizable templates. The smart prioritization automatically organizes tasks by due date and importance. The clean interface minimizes distractions while keeping essential functions accessible.",
      "Utilize location-based reminders that trigger when arriving at or leaving specific places. The time-based alerts can be set with snooze options and escalating urgency. The widget system provides instant task access from home screen without opening the app.",
      "Maintain organization with simple categorization using colors, labels, or projects. The search functionality quickly locates specific tasks across all categories. The backup system ensures task safety with automatic cloud synchronization and export options."
    ],
    "size": 38.2,
    "reviews": 850,
    "ratingAvg": 4.2,
    "downloads": "2.2M",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 195 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4Rzt904W/financetrack.jpg",
    "title": "FinanceTracker",
    "companyName": "MoneyWise",
    "id": 24,
    "descriptions": [
      "FinanceTracker automatically imports and categorizes transactions from connected bank and credit card accounts. The rule system learns from manual categorization to improve automatic sorting accuracy. The recurring transaction detection identifies regular payments for better budgeting.",
      "Monitor cash flow with income and expense reports that show trends over custom time periods. The budget vs actual comparison highlights areas of overspending. The forecasting feature projects future account balances based on scheduled transactions and spending patterns.",
      "Simplify bill management with payment due date calendar and amount tracking. The subscription monitor identifies recurring charges with cost analysis. The financial goals system tracks progress toward targets with visual indicators and milestone celebrations."
    ],
    "size": 36.0,
    "reviews": 920,
    "ratingAvg": 4.1,
    "downloads": "2M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 220 }
    ]
  }
]