[
  {
    "image": "https://i.ibb.co.com/FqfDkmfx/note.webp",
    "title": "SkyNote",
    "companyName": "CloudApps Inc.",
    "id": 1,
    "description": "SkyNote is a modern note-taking app built for people who value simplicity and synchronization across all devices. With its clean, intuitive interface, you can create rich notes combining text, checklists, images, and audio recordings. The app's real-time synchronization ensures your notes are always up-to-date whether you're on your phone, tablet, or computer. Robust organizational features like notebooks, tags, and powerful search make information retrieval effortless. End-to-end encryption guarantees your private thoughts remain secure, making SkyNote the perfect digital companion for students, professionals, and anyone needing reliable note-taking solutions.",
    "size": 32.5,
    "reviews": 1420,
    "ratingAvg": 4.5,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 480 },
      { "name": "5 star", "count": 700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/SD0wzCYR/fitness.jpg",
    "title": "FitTrack Pro",
    "companyName": "Wellness Works",
    "id": 2,
    "description": "FitTrack Pro is your comprehensive personal fitness companion that helps you achieve all your health and wellness goals. This all-in-one app goes beyond basic step counting to offer detailed workout logging, heart rate monitoring, calorie tracking, and sleep pattern analysis. Enjoy personalized training plans with video guides for various exercises from yoga to high-intensity interval training. The social features let you connect with friends for motivation and fitness challenges. With detailed progress charts and actionable insights, FitTrack Pro transforms complex health data into understandable information that empowers you to make better decisions and stay committed to your fitness journey.",
    "size": 58.2,
    "reviews": 870,
    "ratingAvg": 4.3,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 140 },
      { "name": "4 star", "count": 310 },
      { "name": "5 star", "count": 280 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/203rWSf0/taskmamnage.jpg",
    "title": "TaskFlow",
    "companyName": "NextGen Labs",
    "id": 3,
    "description": "TaskFlow brings structure and clarity to your workday by providing a powerful task management solution for individuals and teams. Designed to boost productivity and eliminate the chaos of disorganized to-do lists, this app lets you break down large projects into manageable tasks with clear priorities and deadlines. Multiple viewing options including lists, boards, and calendars adapt to your preferred workflow. Automated reminders and progress tracking ensure you never miss important deadlines. The collaborative features allow seamless task assignment and team coordination, making TaskFlow the perfect platform for streamlining workflows, reducing stress, and achieving more with focused efficiency in both personal and professional projects.",
    "size": 45.8,
    "reviews": 2300,
    "ratingAvg": 4.7,
    "downloads": "7M",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 1170 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Cphb0BTv/finance.jpg",
    "title": "BudgetMate",
    "companyName": "FinTrack Co.",
    "id": 4,
    "description": "BudgetMate is a powerful financial management app that puts you in complete control of your money and helps you build better financial habits. The app simplifies budgeting by allowing you to easily link bank accounts, track income and expenses in real-time, and automatically categorize your spending. Clear visual overviews through interactive charts and reports help you understand your financial health and identify spending patterns. Set realistic savings goals for vacations, emergency funds, or major purchases, and BudgetMate will help track your progress toward these targets. With bill payment reminders and credit monitoring features, this comprehensive tool empowers you to make smarter financial decisions and build a more secure financial future with confidence.",
    "size": 38.4,
    "reviews": 1340,
    "ratingAvg": 4.1,
    "downloads": "4M",
    "ratings": [
      { "name": "1 star", "count": 130 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 390 },
      { "name": "5 star", "count": 450 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vxk4gVdY/editing.webp",
    "title": "PhotoEase",
    "companyName": "PixelCraft Studio",
    "id": 5,
    "description": "PhotoEase redefines mobile photo editing by combining professional-grade tools with an incredibly user-friendly interface suitable for both beginners and experts. This powerful app offers everything you need to make your images stand out, from basic adjustments like brightness and contrast to advanced filters, selective editing, and sophisticated retouching tools for perfect portraits. The one-tap enhancement feature can instantly transform ordinary photos into extraordinary images, while support for high-resolution editing and layers brings desktop-level power to your mobile device. Whether you're a social media enthusiast, photography hobbyist, or professional photographer, PhotoEase provides the creative freedom and technical capabilities to express your visual creativity and produce stunning, professional-quality images with ease.",
    "size": 76.9,
    "reviews": 2980,
    "ratingAvg": 4.6,
    "downloads": "9M",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 1760 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zV8Kjkzk/langagee.png",
    "title": "LinguaGo",
    "companyName": "EduSoft",
    "id": 6,
    "description": "LinguaGo transforms the way you learn new languages by making the process engaging, interactive, and highly effective through scientifically-proven methodology. Moving beyond rote memorization, the app uses bite-sized lessons, interactive games, and real-world conversation practice with advanced speech recognition technology. You'll build vocabulary and grammar skills progressively while immersing yourself in the language through reading, writing, listening, and speaking exercises. Personalized review sessions adapt to your learning pace and performance, ensuring optimal retention of new concepts. With a diverse range of languages to choose from and cultural insights that provide context, LinguaGo serves as your personal language tutor, making the journey to fluency an enjoyable and rewarding experience for learners of all levels.",
    "size": 64.3,
    "reviews": 1790,
    "ratingAvg": 4.4,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 110 },
      { "name": "2 star", "count": 130 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 560 },
      { "name": "5 star", "count": 800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/byF6vm7/cloudestorage.jpg",
    "title": "DriveSync",
    "companyName": "SecureCloud Ltd.",
    "id": 7,
    "description": "DriveSync is a secure and reliable cloud storage solution designed for both individual users and businesses seeking robust data protection and seamless accessibility. In today's digital age where data is invaluable, DriveSync provides a safe haven for your important files, documents, photos, and videos with enterprise-level security measures including zero-knowledge encryption and two-factor authentication. The app ensures seamless file synchronization across all your devices, guaranteeing you always have access to the latest versions of your work wherever you go. With features like easy file sharing, collaborative folders, automatic backup, and generous storage space, DriveSync offers a comprehensive platform for organizing, protecting, and sharing your digital assets while maintaining complete privacy and security against unauthorized access.",
    "size": 89.6,
    "reviews": 2450,
    "ratingAvg": 4.2,
    "downloads": "8M",
    "ratings": [
      { "name": "1 star", "count": 160 },
      { "name": "2 star", "count": 190 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 1080 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Tx896HjM/meditation.jpg",
    "title": "MindCalm",
    "companyName": "Zenify Apps",
    "id": 8,
    "description": "MindCalm helps you find balance and inner peace in your daily life through comprehensive mindfulness and meditation practices designed for modern living. This dedicated wellness app offers an extensive library of guided meditation sessions tailored to various needs including stress reduction, improved sleep, enhanced focus, and anxiety management. Each session is led by experienced meditation teachers and available in different durations to fit any schedule. Beyond guided meditations, MindCalm features calming soundscapes, breathing exercises, and daily mindfulness reminders to help you cultivate a consistent practice. By providing the tools to pause, breathe, and reconnect with yourself amidst life's chaos, MindCalm empowers you to navigate challenges with greater clarity, resilience, and emotional balance, making mental wellbeing an accessible daily practice.",
    "size": 52.1,
    "reviews": 1980,
    "ratingAvg": 4.8,
    "downloads": "6M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 480 },
      { "name": "5 star", "count": 1300 }
    ]
  },

  {
    "image": "https://i.ibb.co.com/demoapp1.jpg",
    "title": "NoteMaster",
    "companyName": "AlphaApps",
    "id": 9,
    "description": "NoteMaster is your intelligent digital notebook designed to capture and organize all your ideas efficiently. This versatile app supports multiple content formats including rich text, audio recordings, handwritten notes, sketches, and web clippings, making it perfect for various note-taking needs. The powerful organization system lets you categorize notes into customizable notebooks and apply tags for quick retrieval. Its standout feature is the advanced search capability that can find text within images and handwritten content. With customizable templates for meetings, project plans, and journals, NoteMaster adapts to your workflow, helping you structure thoughts systematically and access them instantly across all your devices.",
    "size": 28.3,
    "reviews": 980,
    "ratingAvg": 4.2,
    "downloads": "2M",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp2.jpg",
    "title": "HealthBuddy",
    "companyName": "FitLife",
    "id": 10,
    "description": "HealthBuddy is your comprehensive wellness companion that keeps your fitness and health goals perfectly on track. This all-in-one app serves as a centralized hub for monitoring your daily activity, logging nutrition intake, tracking water consumption, and recording workout sessions with detailed metrics. It seamlessly integrates with popular wearables and health devices to automatically sync data like steps, heart rate, sleep patterns, and calories burned. HealthBuddy provides personalized recommendations and wellness insights based on your activity levels and goals. The community features allow you to share achievements, participate in group challenges, and connect with friends for mutual motivation, creating an supportive environment that keeps you accountable and inspired throughout your health journey.",
    "size": 60.1,
    "reviews": 1120,
    "ratingAvg": 4.3,
    "downloads": "3.5M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 550 },
      { "name": "5 star", "count": 260 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp3.jpg",
    "title": "TaskHero",
    "companyName": "Prodigy Apps",
    "id": 11,
    "description": "TaskHero simplifies task management for both teams and individuals by providing a collaborative platform that brings clarity and efficiency to project workflows. The app focuses on visual project management with intuitive Kanban-style boards that allow you to track tasks from 'To-Do' to 'Done' seamlessly. Team collaboration features include task assignments, progress tracking, file attachments, and in-app commenting that keep all project-related communication centralized. With timeline views, priority settings, and dependency management, TaskHero ensures everyone understands their responsibilities and deadlines. The app eliminates the confusion of scattered emails and messages, enabling teams to work cohesively, meet project milestones efficiently, and achieve collective goals with enhanced productivity and transparency.",
    "size": 42.5,
    "reviews": 900,
    "ratingAvg": 4.5,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 260 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp4.jpg",
    "title": "BudgetWise",
    "companyName": "MoneySmart",
    "id": 12,
    "description": "BudgetWise is an intuitive financial app that helps you track expenses and set achievable savings goals with straightforward money management tools. The app's simple setup process lets you create a personalized budget in minutes, while smart categorization automatically organizes your transactions into meaningful spending categories. Clear, colorful charts and visual reports provide immediate insights into your financial habits, showing exactly where your money goes each month. You can set specific financial targets like debt reduction, vacation savings, or emergency fund building, and BudgetWise provides gentle reminders and progress updates to keep you motivated. By transforming complex financial data into actionable insights, the app makes financial discipline an attainable habit for everyone, regardless of their financial knowledge or experience.",
    "size": 35.7,
    "reviews": 760,
    "ratingAvg": 4.1,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 235 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp5.jpg",
    "title": "PhotoSpark",
    "companyName": "ImageMagic",
    "id": 13,
    "description": "PhotoSpark brings creative magic to your photos with quick edits and an extensive collection of artistic filters designed for instant enhancement. This user-friendly photo editing app is perfect for social media enthusiasts and casual photographers who want stunning results without technical complexity. The one-tap auto-enhance feature instantly improves your photos by optimizing lighting, color, and contrast automatically. Beyond basic adjustments like cropping and rotating, PhotoSpark offers trendy filters, creative overlays, decorative frames, and text tools to add personal flair to your images. The app maintains high image quality while providing fast processing, making it ideal for creating visually appealing content for Instagram, Facebook, and other social platforms quickly and efficiently.",
    "size": 70.2,
    "reviews": 1340,
    "ratingAvg": 4.6,
    "downloads": "4.5M",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp6.jpg",
    "title": "LangLearn",
    "companyName": "Polyglot Co.",
    "id": 14,
    "description": "LangLearn is designed to make language learning fun and interactive through engaging exercises and game-like elements that maintain motivation. The app uses a structured approach with bite-sized lessons that build vocabulary and grammar skills progressively. Interactive activities include matching games, pronunciation challenges, listening comprehension tests, and speaking exercises that make practice enjoyable. Cultural notes and fun facts provide context about the languages you're learning, enhancing cultural understanding alongside linguistic skills. The reward system with points, levels, and streaks encourages consistent practice, while personalized review sessions ensure long-term retention. Perfect for beginners and intermediate learners, LangLearn creates an immersive environment that transforms language acquisition from a chore into an exciting daily adventure.",
    "size": 58.9,
    "reviews": 1100,
    "ratingAvg": 4.4,
    "downloads": "2.8M",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 330 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp7.jpg",
    "title": "CloudBox",
    "companyName": "SkyNet Solutions",
    "id": 15,
    "description": "CloudBox provides seamless cloud storage with top-level security features designed for users who prioritize data protection and accessibility. This reliable cloud solution ensures your files are automatically synchronized across all your devices while maintaining robust security through advanced encryption protocols during both transfer and storage. The intuitive interface allows easy drag-and-drop uploading, efficient folder organization, and quick file sharing through secure links. Automatic backup features can safeguard your camera roll and important documents, providing peace of mind against data loss. With generous storage space and reliable performance, CloudBox serves as a trustworthy digital vault for your photos, documents, videos, and other important files, ensuring they remain protected and accessible whenever you need them.",
    "size": 92.3,
    "reviews": 1450,
    "ratingAvg": 4.2,
    "downloads": "5.5M",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 550 },
      { "name": "5 star", "count": 390 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp8.jpg",
    "title": "CalmMind",
    "companyName": "Mindful Apps",
    "id": 16,
    "description": "CalmMind helps reduce stress and improve mental wellbeing through guided meditations and mindfulness practices suitable for all experience levels. This thoughtfully designed app offers a diverse collection of meditation sessions focused on various aspects of mental health including anxiety relief, better sleep, focus improvement, and emotional balance. Each guided session features calming narration from experienced instructors and is available in multiple durations to fit any schedule. Additional features include ambient soundscapes for relaxation, breathing exercises for quick stress relief, and a meditation timer for self-guided practice. Daily mindfulness reminders help you incorporate calm moments into your routine, making mental self-care a consistent habit that enhances your overall quality of life.",
    "size": 50.4,
    "reviews": 980,
    "ratingAvg": 4.7,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 400 }
    ]
  },

  {
    "image": "https://i.ibb.co.com/demoapp9.jpg",
    "title": "TaskManager X",
    "companyName": "EfficientSoft",
    "id": 17,
    "description": "TaskManager X effortlessly organizes your daily schedule and tasks with intelligent prioritization and smart reminders. This robust productivity app helps you capture all your to-dos in one centralized location and then automatically prioritizes them based on urgency and importance. The sleek, customizable interface offers both list and calendar views, allowing you to plan your day, week, or month at a single glance. Advanced features include recurring task options, sub-task breakdown for complex projects, and location-based reminders. With seamless synchronization across devices and intuitive drag-and-drop functionality, TaskManager X ensures you stay on top of all your responsibilities while maintaining a clear overview of your productivity progress and upcoming deadlines.",
    "size": 40.5,
    "reviews": 870,
    "ratingAvg": 4.3,
    "downloads": "2.5M",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 215 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp10.jpg",
    "title": "MoneyManager",
    "companyName": "FinancePro",
    "id": 18,
    "description": "MoneyManager comprehensively tracks your finances and offers smart insights into your spending habits through advanced analytics and reporting. This powerful financial app gives you a complete picture of your economic health by aggregating all your accounts, investments, and bills in one intuitive dashboard. Create custom budgets for different categories, track bill due dates to avoid late fees, and set realistic savings targets for short and long-term goals. The app's intelligent reporting tools analyze your income and expenses patterns, highlighting areas where you can optimize spending and save more money. With investment tracking and net worth calculations, MoneyManager becomes an invaluable resource for making informed financial decisions and building substantial wealth over time.",
    "size": 36.9,
    "reviews": 930,
    "ratingAvg": 4.1,
    "downloads": "2M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 230 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp11.jpg",
    "title": "PhotoEditor Plus",
    "companyName": "CreativeSoft",
    "id": 19,
    "description": "PhotoEditor Plus gives you professional-grade editing tools within a simple, user-friendly interface suitable for both amateur and professional photographers. This comprehensive photo editing solution offers precise control over every aspect of your images, from basic adjustments like exposure and color balance to advanced features including curve adjustments, selective editing, and layer support. The healing tool effortlessly removes unwanted objects and blemishes, while the sophisticated filter collection provides artistic transformations. Despite its powerful capabilities, the interface remains intuitive with logical tool organization and helpful tutorials. Supporting high-resolution output and various file formats, PhotoEditor Plus bridges the gap between mobile convenience and desktop-level editing power, empowering you to create stunning, publication-quality images directly from your mobile device.",
    "size": 75.0,
    "reviews": 1400,
    "ratingAvg": 4.5,
    "downloads": "4M",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 510 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp12.jpg",
    "title": "LinguaMaster",
    "companyName": "LearnX",
    "id": 20,
    "description": "LinguaMaster makes learning languages efficient and enjoyable through a structured curriculum and interactive exercises designed for rapid progress. The app focuses on building practical language skills you can immediately use in real-world situations, from everyday conversations to business interactions. Its comprehensive lessons systematically develop vocabulary, grammar, pronunciation, and listening comprehension through diverse exercise types. Advanced speech recognition technology provides instant feedback on your pronunciation, while spaced repetition algorithms ensure optimal vocabulary retention. The cultural immersion components and real-life dialogue simulations create an authentic learning experience. Whether you're learning for travel, work, or personal enrichment, LinguaMaster's methodical approach and engaging content make the journey to fluency both effective and thoroughly enjoyable.",
    "size": 60.7,
    "reviews": 1100,
    "ratingAvg": 4.4,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 320 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp13.jpg",
    "title": "CloudSync Pro",
    "companyName": "SecureTech",
    "id": 21,
    "description": "CloudSync Pro offers enterprise-grade cloud storage and synchronization services for users who demand maximum reliability and security for their important data. This professional cloud solution ensures your files are automatically synchronized across all your devices in real-time, providing seamless access to your latest work wherever you are. The app employs military-grade encryption standards including end-to-end encryption and optional two-factor authentication to protect your sensitive information from unauthorized access. Advanced features like version history allow you to restore previous file versions, while offline access ensures productivity even without internet connectivity. With high-speed upload capabilities and robust infrastructure, CloudSync Pro delivers the performance and security demanded by professionals, businesses, and anyone who values the integrity and availability of their digital assets.",
    "size": 95.3,
    "reviews": 1200,
    "ratingAvg": 4.3,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 450 },
      { "name": "5 star", "count": 330 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp14.jpg",
    "title": "MeditateNow",
    "companyName": "ZenLife",
    "id": 22,
    "description": "MeditateNow guides you through daily mindfulness exercises and meditation practices designed to fit seamlessly into your busy schedule. This accessible meditation app offers a variety of guided sessions tailored to different times and needs, including morning energizers, midday stress relievers, and evening wind-down routines. The sessions feature calming guidance from experienced meditation instructors and are available in multiple durations to accommodate even the tightest schedules. Additional features include a customizable meditation timer for self-practice, ambient soundscapes for deep relaxation, and a meditation journal to track your progress and reflections. By making mindfulness practice simple and adaptable, MeditateNow helps you cultivate mental clarity, emotional balance, and inner peace amidst life's daily demands and challenges.",
    "size": 50.0,
    "reviews": 900,
    "ratingAvg": 4.6,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 140 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp15.jpg",
    "title": "QuickTasks",
    "companyName": "ProTasker",
    "id": 23,
    "description": "QuickTasks helps you manage your to-do lists with maximum efficiency through a streamlined, minimalist approach that eliminates complexity and distraction. This productivity app focuses on the essentials: quick task capture, simple organization, and easy completion tracking. The clean, uncluttered interface reduces cognitive load and helps you focus exclusively on what needs to be done. Intelligent features include smart suggestions for task entry based on your habits, location-based reminders that trigger when you reach specific places, and home screen widgets for instant access to your lists. With seamless synchronization across devices and optional categorization using labels or projects, QuickTasks provides just enough structure to keep you organized without the overhead of complex project management systems.",
    "size": 38.2,
    "reviews": 850,
    "ratingAvg": 4.2,
    "downloads": "2.2M",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 195 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/demoapp16.jpg",
    "title": "FinanceTracker",
    "companyName": "MoneyWise",
    "id": 24,
    "description": "FinanceTracker seamlessly monitors your spending and income patterns, providing immediate clarity about your financial situation through intuitive dashboards and visual reports. This comprehensive money management app allows for both manual transaction entry and automated bank connectivity, giving you flexibility in how you track your finances. The intelligent categorization system automatically sorts your expenses into meaningful categories, providing instant insight into your spending habits. Customizable budgeting goals help you stay within your financial limits for different expense categories, while visual reports and charts make it easy to understand your cash flow at a glance. With bill tracking and savings progress monitoring, FinanceTracker empowers you to make informed spending decisions and develop healthier financial habits for long-term stability.",
    "size": 36.0,
    "reviews": 920,
    "ratingAvg": 4.1,
    "downloads": "2M",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 220 }
    ]
  }
]